W7D3/music_app/app/views/users/show.html.erb

SELECT "bands".* FROM "bands"
---
    <ul class="band-list">
    <% Band.all.each do |band| %>