W6D5/cats99/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "fluffy-v2.1"], ["updated_at", "2022-05-27 23:46:52.735294"], ["id", 1]]
---
  def update
    cat = Cat.find_by(id: params[:id])
    if cat.update(cat_params)