W7D5/RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        if post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "testing"], ["url", "whats?"], ["content", "lskjdlkfjs"], ["sub_id", 1], ["author_id", 1], ["created_at", "2022-06-04 00:46:22.815215"], ["updated_at", "2022-06-04 00:46:22.815215"]]