W7D5/RedditClone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "1"], ["description", "2"], ["updated_at", "2022-06-03 21:02:10.806792"], ["id", 4]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.update(sub_params)