W7D5/RedditClone/app/views/posts/_form.html.erb

    <br>
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"